[AdventPriestArmor X2ArmorTemplate]
FriendlyName="Броня жреца Адвента"
FriendlyNamePlural="Броня жреца Адвента"
BriefSummary="Броня жреца Адвента оснащена дополнительной сеткой направляющих пси-контуров что усиливает пси-силу бойца, одетого в нее. Так же она оснащена системой экстренного спасения, благодаря которой жрецов так тяжело добить."
TacticalText="Броня жреца Адвента оснащена дополнительной сеткой направляющих пси-контуров что усиливает пси силу бойца одетого в нее. Так же она оснащена системой экстренного спасения, благодаря которой жрецов так тяжело добить."


[AdventPriestArmorDetectionStat X2AbilityTemplate]
LocFriendlyName="Обман"
LocLongDescription="Солдат одетый в броню врага лучше проникает на миссии, а его радиус обнаружения меньше на 25%"
LocHelpText="Солдат одетый в броню врага лучше проникает на миссии, а его радиус обнаружения меньше на 25%"
LocFlyOverText="Солдат одетый в броню врага лучше проникает на миссии, а его радиус обнаружения меньше на 25%"
LocPromotionPopupText="<Bullet/> Солдат одетый в броню врага лучше проникает на миссии, а его радиус обнаружения меньше на 25%"


[AdventPriestArmorUniquePassive X2AbilityTemplate]
LocFriendlyName="Псионическое усилиление"
LocLongDescription="Броня жреца Адвента дает дополнительную пси-силу бойцу и защищает его от смерти 1 раз за задание, активируя стазис."
LocHelpText="Броня жреца Адвента дает дополнительную пси-силу бойцу и защищает его от смерти 1 раз за задание, активируя стазис."
LocFlyOverText="Броня жреца Адвента дает дополнительную пси-силу бойцу и защищает его от смерти 1 раз за задание, активируя стазис."
LocPromotionPopupText="<Bullet/>Броня жреца Адвента дает дополнительную пси-силу бойцу и защищает его от смерти 1 раз за задание, активируя стазис."
